Revit 2026 API

# LightTypeColorFilter Property

---

The light filter color.

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Color ColorFilter { get; set; }
```
```vb
Public Property ColorFilter As Color
	Get
	Set
```
```cpp
public:
property Color^ ColorFilter {
	Color^ get ();
	void set (Color^ value);
}
```
```fsharp
member ColorFilter : Color with get, set
```

#### Property Value

Color

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

LightType Class

Autodesk.Revit.DB.Lighting Namespace